Dlubal.TimberPro.DesignSituationType
Design situation type

Dlubal.TimberPro.DesignSituationType.UnknownDesignSituationType
Unknown

Dlubal.TimberPro.DesignSituationType.PersistentAndTransientType
Persistent and Transient design situation

Dlubal.TimberPro.DesignSituationType.AccidentalType
Accidental design situation